v2312/run/assignment_02/cylinder_kEps_integro/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    down
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          200;
        startFace       20672;
    }
    right
    {
        type            patch;
        nFaces          48;
        startFace       20872;
    }
    up
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          200;
        startFace       20920;
    }
    left
    {
        type            patch;
        nFaces          48;
        startFace       21120;
    }
    cylinder
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          80;
        startFace       21168;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20960;
        startFace       21248;
    }
)

// ************************************************************************* //
