v2312/run/assignment_02/cylinder_kEps_integro/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         20;

deltaT          0.0001;

writeControl    timeStep;

writeInterval   1000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


functions
{
    yPlus1
    {
        // Mandatory entries (unmodifiable)
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        
    timeStart       0;
    timeEnd         20;
    //executeControl  timeStep;
    //executeInterval 1;
    writeControl    timeStep;
    writeInterval   1000;
    }

    Co1
    {
        // Mandatory entries (unmodifiable)
        type            CourantNo;
        libs            ("libfieldFunctionObjects.so");
        
    timeStart       0;
    timeEnd         20;
    //executeControl  timeStep;
    //executeInterval 1;
    writeControl    timeStep;
    writeInterval   1000;
    }
}


// ************************************************************************* //
